In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv("text/scores.csv", index_col=0)
df

     국어  영어   수학   합계
김연아  70  76   60  206
최동원  80  87   79  246
박병호  58  59  100  217
허재   69  70   45  184
이만기  70  72   78  220
오승환  40  45   98  183

In [8]:
df.to_json('text/kedu_score.json')

In [9]:
df2 =pd.read_json("text/kedu_score.json")
df2

     국어  영어   수학   합계
김연아  70  76   60  206
최동원  80  87   79  246
박병호  58  59  100  217
허재   69  70   45  184
이만기  70  72   78  220
오승환  40  45   98  183

In [10]:
df.to_html("text/kedu_score.html")

In [14]:
df_h = pd.read_html("text/kedu_score.html", index_col=0, encoding='UTF-8')
df_h

[     국어  영어   수학   합계
 김연아  70  76   60  206
 최동원  80  87   79  246
 박병호  58  59  100  217
 허재   69  70   45  184
 이만기  70  72   78  220
 오승환  40  45   98  183]

In [21]:
df_html = df_h[0]

In [24]:
df_html

     국어  영어   수학   합계
김연아  70  76   60  206
최동원  80  87   79  246
박병호  58  59  100  217
허재   69  70   45  184
이만기  70  72   78  220
오승환  40  45   98  183

In [25]:
import sqlite3
con = sqlite3.connect('text/test.db')

In [30]:
dbdf=pd.read_sql('select * from scores', con, index_col='이름')

In [40]:
dbdf.loc[:'미영', ['국어']]

     국어
이름
철수   84
영이   21
길동   87
미영  100